---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManager.Contains(Autodesk.Revit.DB.Macros.MacroModule)
source: html/01c64409-346b-5d8c-757c-28fde44938c4.htm
---
# Autodesk.Revit.DB.Macros.MacroManager.Contains Method

Indicates the given module is a member of this collection.

## Syntax (C#)
```csharp
public bool Contains(
	MacroModule module
)
```

## Parameters
- **module** (`Autodesk.Revit.DB.Macros.MacroModule`) - The module.

## Returns
Returns true if the given module is a member of this collection, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null